{"podcast_details": {"podcast_title": "Grain Markets and Other Stuff", "episode_title": "More HEAT + Crop Tour Day One", "episode_image": "https://storage.buzzsprout.com/variants/gx7d8k98u2gwmvaem70pbzcy9s5y/e70382d1824eed07bf51f8b9742413cd1ad490e9f893e8ff33e49d552d3c73ea.jpg", "episode_transcript": " Trading in futures products entails significant risk of loss, which must be understood prior to trading and may not be appropriate for all investors. Good morning, everybody. It's Tuesday, August 22nd, 529 a.m. Central Time. Mixed trade in the grain markets this morning. December corn futures up one and a half at 484. November soybeans down two at 1359 and three quarters. December Chicago wheat up eight and three quarters at 634 and a quarter. December Kansas City wheat up six and a quarter at 754 and a half. December spring wheat up three and three quarters at 802 and three quarters. It's going to be hot again today the way that it looks. You bet it is. Heat's going to be a factor throughout the U.S. Plains and into the Corn Belt today. Temperatures in the southern plains will again top 100 degrees, while temperatures in most of the Corn Belt will reach the 90s. Rainfall remains largely absent from the forecast. The seven day government map offers only limited chances. The 10 day euro and GFS models are also dry. Below normal precipitation is expected to continue through the six to 10 and eight to 14 day periods. The markets got excited about this on Sunday night and into Monday morning. And then we saw kind of a failure of enthusiasm. The corn market finished the day sharply lower yesterday. The soybean market still finished higher but well removed from the highs. If you take a look at the November soybean chart, it went up. It filled an old gap at about 1379 and then backed off and we're 20 cents removed from those highs this morning. When it comes to weather and markets, this time of year is tricky. The correlation between weather and price action just seems to disintegrate a little bit once August rolls around. From June and July, like mid-June into say the first week of July, that's kind of prime time for weather and markets when the correlation is the strongest. This time of year, it's a little bit more tricky. It's a little bit more tricky to look at a weather forecast and try to figure out what the market's going to do. And I think that we saw just that here early this week. Pro Farmer released tour results from South Dakota and Ohio yesterday. The South Dakota corn yield was pegged at 157.4 bushels per acre versus last year's tour estimate of 118.5 bushels per acre. The average pod count per 3x3 area was seen at 1013 versus 871 last year. The Ohio corn yield was pegged at 183.9 bushels per acre versus last year's tour estimate of 174.2 bushels per acre. The average soybean pod count was seen at 1253 versus 1132 last year. The corn and soybean findings from both states were better than last year. So generally speaking, everything better than last year. Both states corn, both states soybeans, tour findings better than last year. Here's a couple of graphics that Agday had on Twitter. So the South Dakota corn yield estimate, Pro Farmer versus Pro Farmer, is up 38.9 bushels per acre from last year. The Ohio corn yield estimate up 9.7 bushels from last year tour to tour. I'm not going to get, there's a million ways you could analyze this. I'm not going to get in too much into Pro Farmer versus USDA and historical correlations. My general take home from the tour findings yesterday is that the crop prospects are pretty good. We've got better findings versus last year. There's nothing here that leads me to believe that any of this is going to be a disaster at this point. Today, they're going to move into Indiana and I believe Nebraska and we'll see findings from those states this evening. And then they'll be in Iowa and Illinois, I believe the final day of the tour. Also they're going to do some in Minnesota. So more tour findings to come, but I didn't see anything that was like overly bullish or drastically different than what we're expecting yesterday out of the tour. So if you guys aren't already subscribed to our premium content, you need to do so. Joe, can you tell me about the video you put together yesterday regarding crop insurance? If you're a corn and soybean farmer and you're in the central corn belt and you have 85% revenue protection in terms of your crop insurance situation, this is a video that you should watch. Should I protect crop insurance payments? So if that's your situation, you got an 85% RP, you are looking at an APH crop or maybe not an APH crop. The December corn price right now, if continued, if this sort of price continues, like the 480s continues through the month of October and that's your harvest average, you're looking at an insurance payment just due to price, not because of lack of yield or anything like that. Should I protect that insurance payment? Meaning that what if corn goes from 480 back to 510 and 510 is the average in October, then I'm not going to get that insurance payment. So should I seek to protect it? I ran through all sorts of historical stuff, years that have precedent for this sort of thing, some strategies, my two cents on the whole situation. If you guys are farming, especially in the central corn belt, you've got that 85% RP. I think this is a must watch. Go to standardgrain.com. I'll send you this video this morning. If you sign up, this is a $50 per month subscription. You can cancel it any time. No other fee, no other obligation. Nobody will try to sell you anything else. Just a ton of info direct from us every single business day, guys. It takes like one minute to sign up on your phone or on your computer. You just need your credit card. US corn ratings declined marginally last week. The crop is rated 58% good to excellent nationally versus 59% the prior week and 61% on average. States with a good to excellent rating below 50% include Minnesota, Missouri, and Kansas. USDA estimates that 4% of the crop is mature nationally versus 4% on average. The soybean rating in Illinois went down 5%. That is of note because Illinois is your top soybean producing state, yet the corn rating in Illinois was unchanged. Both of those ratings, you're still sitting pretty close to average. The Illinois soybean rating is still at you one point above average, whereas it had been like a total disaster early in the year and Illinois corn rating is 1% below average. So I don't know. I mean, these ratings are close enough to your five-year average where you could make an argument that we're going to be close to trend in terms of the yield. I know that's not what people want to hear. It's not what USDA is putting out there either, but it's not a bad rating for corn, generally speaking, versus the five-year average. Soybean ratings were unchanged. The crop is rated 59% good to excellent nationally versus 59% last week and 60% on average. States with a good to excellent rating of 50% or below include Minnesota, Missouri, and Kansas. USDA estimates that 86% of the crop is setting pods versus 84% on average. That list of states that's 50% below or worse, that list of states has grown shorter here over the last few weeks. It used to be we were throwing five or six states in there. Now it's down to three. So you have seen a contra seasonal improvement in ratings. I'll be curious to see how the soybean ratings look a week or two from now after this hot and dry spell. You would think that it would have an impact. At the same time, you've got to be aware of the fact that seasonally crop ratings decline as crops mature and harvest approaches. So that's another thing to be aware of. Kaitlin Luna-Sandler Spring wheat harvest is behind schedule. The crop was 39% harvested through Sunday versus 24% the prior week and 46% on average. The crop was rated 38% good to excellent nationally versus 42% the prior week and 70% on average. The US winter wheat crop is 96% harvested versus 96% on average. If you guys are up north and you have some yield reports in regard to spring wheat, drop them in the YouTube comments. We would love to see that stuff. Hosted by The U.S. Department of Agriculture USDA reported flash sales of US corn and soybeans on Monday. US exporters sold four million bushels of corn to Mexico for delivery during the next marketing year. They also sold six million bushels of soybeans to unknown destinations for delivery during the next marketing year. So US corn, the way that it's priced on the export market, it's very similar to the way Brazilian corn is priced. So we're not like super competitive versus Brazil even through the end of the calendar year, which is a problem. And this is when people talk about demand problems in corn, I think a lot of people are talking about new crop export sales in particular and the fact that USDA is projecting this big year over year increase, yet we have absolutely nothing to support that sort of theory. So that's your problem. And it's nice to see flash sales, but these are not like the amounts that you really need to see. So soybeans are competitive and we should see some more business hopefully during that for delivery after September 1st, of course. Ukraine is considering exporting grain through a recently established humanitarian corridor. The route runs along the Western Black Sea coast near Romania and Bulgaria. A container ship stranded in the port of Odessa was able to navigate the route last week without being attacked. Ukraine is also finalizing a plan with global insurers to provide coverage for grain ships traveling to and from its Black Sea ports. Despite the plan, ship owners are hesitant to travel along Black Sea routes, of course, due to recent Russian attacks. If anything, all of the Black Sea news these last few days has been more bearish, if anything. You've got just a lot of efforts to increase shipments on a lot of different fronts. This insurance thing also, I'm not going to say it's like super bearish, but it's not bullish and you've got all three classes of wheat that we trade on the exchanges here trading within an earshot of calendar year lows. You could be at calendar year lows in your HRW, your SRW, your spring wheat as early as it could happen today. So the market has not acted well. I don't know if it's because of this news, but this news definitely doesn't help. US corn shipments improved slightly last week. USDA reported that 482,526 metric tons of corn were inspected for export during the week ending August 17th. The print was up 5.1% on the week, but down 41% versus the same week last year. Accumulated sales are running behind last year by 33%. Soybean shipments declined 24% from the previous week, totaling 316,074 metric tons. Wheat shipments were reported at 311,314 metric tons. Those were up 16% compared to the previous week and of course the current marketing year ends here on August 31st. We were doing a lot better in terms of shipments last year. This same week, a year ago, corn shipments were like over 800,000. We were 480 this week. Soybean shipments were like half of what they were a year ago. The export program in regard to both is just really not where we'd like to see it. We did have a cattle on feed report on Friday. How did we act yesterday? Pretty positively. Feeder cattle futures closed an average of $1.84 higher. Live cattle futures, they were up an average of 74 cents higher. Cash cattle trade hasn't taken off yet, of course. Boxed beef had a pretty stagnant day yesterday. Choice ended the day at 315.56. That was down 55 cents. Select ended the day at 287.33. That was down a buck 03. Outside markets this morning, US dollars about flat. Stock market's higher. S&P's up 20. The Dow's up 85. I think there was another bank downgrade yesterday, which is not a big positive. Bonds are up. Gold's up eight bucks. Crude oil is down 30 cents at 79.82 in the October WTI. Everybody have a great day today. We'll talk to you Wednesday."}, "podcast_summary": "The podcast opens with a discussion about the trading of futures products, emphasizing their riskiness and the need for caution. It then proceeds to give an overview of the grain markets with details about the trading figures for corn, soybeans, Chicago wheat, Kansas City wheat, and spring wheat. \n\nElevated temperatures are noted to be a significant concern across the U.S. Plains and Corn Belt, with no substantial rain forecasted for at least two weeks. Despite initial market excitement around these unfavorable weather conditions and potential impact on crop yields, the podcast host notes a decreased correlation between weather and market actions as August commences.\n\nPro Farmer's tour results from South Dakota and Ohio revealed encouraging findings with better crop prospects compared to the previous year. But the host cautions against relying heavily on these results without considering other factors like overall weather conditions and crop health.\n\nThe host mentions a video guide to protecting crop insurance payments, emphasizing its importance for corn and soybean farmers in the Central Corn Belt with 85% revenue protection. \n\nThe USDA reports a slight decline in U.S. corn ratings, with good to excellent ratings below 50% in Minnesota, Missouri, and Kansas. Soybean ratings have remained unchanged on a national level but have dipped slightly in Illinois. The host concludes the episode by discussing the potential impact of Ukraine's efforts to increase grain shipments on the U.S. grain market. Producers and traders are advised to watch for further developments.\n", "podcast_guest": "Joe", "podcast_guest_summary": "Joe", "podcast_highlights": "1. Mixed trade in grain markets - December corn futures were up while November soybeans were down. There was also an upsurge recorded in Chigaco wheat, Kansas City wheat and spring wheat.\n2. The hot weather is expected to persist in the US Plains and into the Corn Belt, with temperatures topping 100 degrees in some areas. This heat wave has likely affected the farming industry as there has been a significant absence of rainfall.\n3. South Dakota and Ohio reported higher corn yield and average pod count than last year according to Pro Farmer. Pro Farmer's survey in those states found the crop prospects are generally good.\n4. Expert pointed out problems with the new crop export predictions from the USDA, saying there is nothing to support theories of a large increase in the coming year.\n5. Ukraine is considering exporting grain through a newly established humanitarian route on the Western Black Sea coast near Romania and Bulgaria. However, ship owners are hesitant to travel these routes due to recent Russian attacks. \n6. The positive performance of the Feeder cattle futures and Live cattle futures on the market is recorded. Cash cattle trade hasn't taken off yet, but the boxed beef had a stagnant day.\n7. Weather and markets correlation tends to disintegrate a little bit during the month of August as the forecasts and the effects on the market becomes more tricky to predict compared to June and July.\n8. There was a decline in the US corn sales for export last week, which was down 41% versus the same week last year, whereas wheat sales were up 16% compared to the previous week. This implies the export program isn't where it should be."}