{"podcast_details": {"podcast_title": "Storytime", "episode_title": "r/AITA MY KIDS ARE NEVER LEAVING THE COUNTRY! - Reddit Stories", "episode_image": "https://assets.pippa.io/shows/623dee2693448e0012f6d788/1692023025839-4f8afddb0bedb1650de5c06cbf46baa5.jpeg", "episode_transcript": " Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the U.S. Over 15 million this year alone, and many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated U.S.-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at LifeLock.com slash Acast. Identity theft protection starts here. Would you be the jerk for refusing to allow your ex to get the kids their passport? We'll get into that in a bit, but first, am I the jerk for not giving my brother and his wife the gift I got them, since she didn't want me at his birthday party? I, male 39, travel for work and make good money. I've never been interested in settling down or having a family. I mostly work and take vacations. I don't own an apartment, much less a house. I live out of a backpack and a duffel bag. My brother Victor, 30, is the opposite. All he ever wanted since he was a kid was to have a perfect family. Our dad did the same kind of work that I do, and Victor hated it. He was always closer to our mom than our dad. He married the first girl he dated after college, and they already have two kids. They are happy, and I love my brother and my nephews. I spend a bunch of my extra money on them, because I have more than I need, and I want them to have a great life. My brother chose to be a teacher so he could spend more time with his wife and kids. I respect that, but he isn't well paid. His 30th birthday was coming up, and I decided to do something nice for his family. I checked with him when he and his wife had a free week this summer, and I got them a week away at Disney World. I also paid for my folks to go along so they could watch the kids and give him and his wife some alone time. His wife thinks I'm a scumbag because I refuse to get a girlfriend or have a serious relationship. I don't want that. I like meeting a woman at a resort or on a tour, spending a week together and then saying goodbye. It works for me. They don't want anything more from me than I'm willing to give. Because she thinks I'm a degenerate, womanizing, alcoholic dirt bag, she doesn't want me around her husband or children. So she made sure I knew I wasn't invited to his birthday party at their house. I am seriously tired of her bull crap, so I cancelled everything. I took my mom and dad on a golf vacation instead. I sent my brother a card with a $100 gift card to a restaurant he likes. My sister-in-law found out from my parents what his original gift was going to be and has been contacting me, saying that I'm being a jerk taking away an experience like that from her family over a party invitation. I told her that she was the one who decided I wasn't good enough to be around her family, so my dirty money wasn't going to be around her either. I told her not to bother me anymore. My folks are staying out of it and my brother is as well. He knows I don't owe him crap and that I just like to blow money on stupid gifts. So personally, I think if you want to live that bachelor or bachelorette life, go around, have connections with people for a short period of time, as long as you're not hurting or harming anybody. I don't think that's a problem and I definitely think it's very judgmental for your sister-in-law to say oh you're a womanizing alcoholic dirtbag. And it's especially rich that they still want your money, they still want your lavish gifts, but they also want to just slap you in the face for you being you. I definitely don't think OP's in the wrong here. Do you guys feel the same way? Also hi, I'm Steven and if you guys enjoy getting to decide whether or not all of these people are jerks, why not hit those like and subscribe buttons down below. That said, our next story is... Am I the jerk for telling my husband if you want someone to stay home with our baby, he can do it? For context, I'm currently 29 weeks pregnant, my husband 29 year old male, and I 30 year old female, met in college and have been together for 8 years, married for 2. Our relationship has always been solid and progressive. My husband's never been much of a traditionalist despite growing up in a very stereotypical family, had 2 siblings and a stay at home mom, his dad worked. Up until recently we've agreed on nearly everything, save for small things, and our marriage and how to raise kids. However, 2 days ago we were talking about baby stuff and my husband started mentioning that he thought maybe one of us should stay home with the baby for a while and not go back to work after our paternity or maternity leave is over. We both work in tech and make good money and have great benefits. I get 20 weeks of leave after the baby is born, he gets 12. We were trying to decide if we should stagger our leave so someone could be home with the baby until 6 months, the age where most places near us will start daycare. My husband said that he read that it's better for the baby to have a parent home for the first year, so I asked him, thinking nothing of it, if that's really something he would consider since he might have to quit his job. He asked why he would have to quit, since I should obviously be the one to stay home with the baby. I asked him if he was serious and he said yes, the mom should be the one to stay home. I said how are we going to make that work on just his income? For context, I make about 3 times what my husband does, it's never been an issue and never mattered to me. I just finished my masters earlier than he did, we both have them, and went into a more specialized field. We both make good money, but it's my job primarily that pays for the lifestyle we have, so I asked him what we were going to do for a year on 1 fourth of the income with a new baby. He got a little upset and said I shouldn't even bring that up, and that he makes good enough money to provide for us, and I shouldn't question him. I got mad, and said it wasn't realistic and it was silly for the person who made more money to quit their job, especially since he's the one who thinks someone should be with the baby extra time. I was fine with sending the baby to daycare starting at 6 months. The fight blew up from there, me saying he's being sexist and not considering my feelings at all. I refused to back down, and he ended up taking off after I said that he should be the stay at home parent if he wants one so bad, and him saying he didn't deserve to be emasculated just for suggesting I should stay home like a good mom. I talked to some of my family and his family about it, and the answers are kind of split. So am I the jerk for bringing up the pay disparity and telling him that unless he's the one to stay home, baby's going to daycare? So first of all, off the top I don't think OP is the jerk here, and I do think there's a lot of sexist behavior going on from the husband. Obviously in their mind, whether or not they're going to come out and just say it full on, they clearly have this conception that the women are the ones who have to stay home, raise the children, quit their jobs. All I'm saying is, if I were in the husband's shoes, and my wife, who was making 3 times more than me, said, okay, are you okay quitting your job and working to raise the baby? I'd probably be like, yes honey, thank you honey, keep raking in the dough and supporting our young family. I just hope he comes around and realizes that daycare is a very reasonable thing, and not try to force the family into a terrible decision. Our next story is, am I the jerk for shaming my alpha male boyfriend about his job? Around a year ago, I, 19 year old female, moved to the US for university. In my first week there, I met my now 21 year old male boyfriend. However, 6 months ago, he dropped out to start a dropshipping business. He was a sociology major for context. I try to persuade him to stay in school for a backup plan, but he explained to me that the dropshipping market is huge, and he'll make more money than he would if he got his degree. A while ago, I got a waitressing job at a very popular food chain. If I said the name, it's likely a lot of people would know it, and for context, my work is the first location in the chain. I won't lie, I make minimum wage, but decent with the tipping. My boyfriend's business actually makes decent money, around $3000-4000 per month. It doesn't get much... Oh, it gets smoother. It's getting delivered tomorrow. Visit carvana.com or download the app to get pre-qualified today. Think identity theft won't happen to you? Think again. There's a new victim every 3 seconds in the US. Over 15 million this year alone, and many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated US-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at lifelock.com slash a cast. Identity theft protection starts here. This sounds good, but he has a terrible attitude and thinks everyone's still in school? Has a job paying less than him or doesn't own their own business is inferior? He also considers him an alpha male and continuously watches business lessons on YouTube shorts. Yesterday we got into a fight. It all started when I got home from work and was going to tell him about how we got a surprise visit from a worker at our restaurant and was and how we got along so well. The first thing he said was, how old is she? What's her salary? Huh, must be $750 an hour. I told him that she was around my grandmother's age and he started berating her for still working at her age and how she still doesn't have enough money to retire. I was getting really irritated at him and decided to tell him the rest of my story about her. Her and her husband founded the chain. They're probably multi-millionaires. They've earned more than you will probably ever make with your business. I definitely said more, but I can't remember what exactly. I think he started crying cause he stopped talking and locked himself in the bathroom. The last thing he said to me was, can you actually stop shaming me? My job pays for our rent. I feel so horrible about what I said, but I just thought he needed to understand that making fun of people's jobs is terrible. I also understand that I do live with him and his job definitely lets us live more comfortably than the average people our age. You know, I've been on YouTube shorts a time or two and every once in a while for some reason it seems like it feeds me this genre of video. Where it's like some presentation, everybody's sitting in like a classroom formation with a guy at the front and he's like, you know why you're all poor? Or you know why you're unsuccessful? Or just some like weird thing about how you've got to rework your brain or reshape how you think about things. So you can make all this money and be such a successful businessman and focus on what's important. It just seems like such a scammy, weird black hole to fall into. I feel like it's the economic version of an Andrew Tate type thing. Anything that tries to sell you on becoming the alpha male of whatever category, there's already way too many alarm bells firing off in my mind. Our next story is, am I the jerk for only paying for my wife and I at a restaurant? I, 24 year old male and my wife, 24 year old female, are newlywed couples. My wife has four friends who she's been really close with since high school. For a celebration, my wife decided to go to an expensive steakhouse. The day comes and we go in separate cars there. We all eat and my wife slides the bill, 700 plus, and proceeds to say, the man should always pay for the wife and her friends. I laugh awkwardly saying why. She says because I'm the man. I tell her that the only other person I would pay for would be you and me. Her friends proceeded to laugh at me, calling me a broke husband. I stand up and put two $100 bills for me and my wife's food and leave. My wife gets home and starts screaming at me, saying I made her feel embarrassed. How she promised her friends I'd pay, and that her friends made fun of her on the ride home for marrying a man who can't pay the bill. I decided to pack a bag and head to my friend's house. I told my parents and friends, and they say I should've just paid it. Now I'm having second thoughts if I overreacted. Am I the jerk? Edit 1 Hi guys, I've read someone's comments if my wife has ever acted like this, and she never has. That's why I just laughed awkwardly. The only other time she did this was when I didn't buy her mom food, which happened when we first started dating, and it was the first time she ever screamed at me like that. Instead of escalating it, I just left. And when we do argue, it's not a screaming match. For how long we've dated, I've known her since freshman year of high school, and got together junior year, dated for 8 plus years. I read some comments and decided to go talk to her tomorrow about what happened, why she did that, etc. I do recognize that I didn't pay the full amount of me and my wife's dinner. I do take fault in that. I should've added another $50-$75 to make it the price of two people. For the people who say I forgot to tip, I go there regularly with my coworkers, each pay for their own plate, and always leave a good tip. Honestly, I don't know if I can really fault OP here. Maybe they did act a little rough here, a little too quick to stand up, throw money down, and storm out. But I kind of get it, because it's really kind of a pressureful situation, everybody's kind of pointing fingers, almost kind of belittling slash peer pressuring you to try to get you to pay for it anyways. And I agree that OP is not responsible for paying the whole bill of everybody that showed up, regardless or not if their wife promised. I hope that OP and their wife can talk about it and figure it out. Our next story is, am I the jerk to tell my daughter not to be so needy? I, 55 year old male, have been married to my wife, 51 year old female, for 29 years. We recently moved our 19 year old daughter into her college apartment. My wife had already helped move in the day before, and we had to help finish up the process. Upon arrival, we moved the boxes into her apartment. After we took all of her things in, I figured we were done. My wife informed me that she was going to help our daughter unpack and get settled in. I asked how long it would take, and she told me about an hour. I waited in the living room as my wife and daughter unpacked. After an hour, I went in to see how much longer they would be, and my wife was busy helping our daughter decorate. I politely said that our daughter didn't need help with decorating and that she had plenty of time to decorate the next day before classes started. My wife told me that she was going to help, and that since we didn't have any other plans, time shouldn't matter. My wife does a lot for our kids, and I think that because they're young adults, they can do things for themselves. This is one of those cases. When it was time to leave, we drove our daughter to the music building because she had an audition for vocal ensemble. My wife got teary eyed and gave her a hug goodbye. I got out of the car and told my daughter that I didn't mean to offend her, but what if something happened to either of her parents? What would she do? She needed to stop being so needy. My daughter got mad and said I ruined everything. My wife yelled at me and said that she wished I hadn't even come. I walked away. Finally I got in the car, and we drove home in silence. Am I the jerk? I just think OP's handling this and saying their feelings all in a very wrong way. I don't think there's any problem in wanting to instill your kids with some form of independence, raising them to be self-sufficient, but being so blunt about it, and especially during a time where the wife wants to spend some time with her, I just think it's going about it all the wrong way. Our next story is, am I the jerk for flying first class while the rest of my family is flying economy? I, male 38, my wife, 39, and my three kids are currently on vacation. Basically I'm part of the loyalty club with the airline we were traveling with, and that means that there's lots of cool perks, like a lounge, points, food, etc. I also rack up a lot of points, which is always a nice side. Given I don't want to dish out 10 grand on a flight ticket, we're all traveling economy. However, 20-25 minutes before boarding began, they called my tier of the loyalty club. Turns out they have a couple vacant first class seats that they can...upgrade loyalty to. It would cost $500. This is a pretty good deal given it's a long overnight flight. Luckily I could also use some points, so I only paid about $150 for what is a massively better flight experience. They issued the ticket and everything. When I told my wife, she was very unhappy. She controlled it for the sake of being in an airport, but I could tell. She said it was very bad that I didn't ask her first, and it would be too hard to manage three kids? Under 10 and one is an in- Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the US, over 15 million this year alone, and many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated US-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at LifeLock.com slash Acast. Identity theft protection starts here. I went back to the desk to see if it could be changed back, and they said it's not possible. We've landed now and my wife refuses to talk to me and says we need a serious discussion. 100% OP is not only the jerk, but they are in the dog house now. This is one thing if like you're going with a bunch of family. It's another when you're literally ditching your wife and your kids. To go sit in first class luxury by yourself. I'm sorry, but I think just about anybody in the wife's position is going to be particularly upset. Did you enjoy your mimosas and first class, darling? Our next story is, am I the jerk? Refused to help my privileged wife cover her increased cost of living. So I, male 39, am married to the love of my life, female 36. We have two sweet kids, ages 5 and 9, and we all live in a house in a nice small typical Scandinavian town. Our economy is mostly shared, more on this in a bit. I'm an engineer, working as consultant. Great pay and benefits. I make more than I spend. My wife has a master's degree in human communication. A horribly useless degree, even according to herself. Since graduating something like 8 years ago, she's been unable to find a job in her field. Note, those 8 years does include her second pregnancy and maternity leave. Here's the thing. My wife has very wealthy parents, like no financial worries at all wealthy. Thanks to them, her share of our house was gifted to her. I still pay mortgage on my share. They gifted her a brand new car, I drive my own. Each Christmas, they give her $20,000. Her, not me. Besides that yearly gift, she has more or less been without income for most of her adult life. Including when she attended university. She did a few odd jobs here and there. We share all family related expenses. Utilities, food, insurances, vacations, kid stuff and so on. Through a shared account. 50-50. Besides that, we have our own accounts. But many purchases go towards the family, house and kids anyway. So it's not like air tight. You know how it is. My wife recently got a part time job, 15-20 hours a week, in a clothing store. Pay is terrible. Hours are weird and she doesn't get along with the owner. Therefore, she's considering quitting. I'm telling her to go ahead but also that even a bad job pays better than no job. In my opinion, she's a little picky with the jobs. Won't do cleaning, elderly care and other stuff like that. Despite those being jobs, she's able to get without any qualifications. She keeps applying for jobs in her own field but so far without any luck besides a couple of first round interviews. The market is very limited. Because of increased cost of living, you all know the story, her yearly gift and small paycheck doesn't quite cut it anymore. She tells me that she's barely making ends meet. Therefore, she's asked me to help her out by paying a larger share of our shared expenses. I basically said no. I told her that not many people are as privileged as her and that she really should be less picky. I even consider re-qualification, new education and or field of work. I felt bad telling her but also needed to be honest with her. I could help her out but that just doesn't sit right with me all things considered. So now of course, according to her, I'm a jerk. But am I? Yeah, I think this is kind of dysfunctional on both sides. When there's a mortgage to be paid and she keeps a $20,000 gift all to herself. That signals a problem to me in a marriage and then when she's going through stuff or there's a situation where you could help your wife out, you go, it doesn't sit right with you. That also does not seem right to me in a marriage. I think there's dysfunction going on on both sides here to be honest. My question is, how happy are you with each other at this point? I think there's a bit of fault on both ends. This next story is... Am I the jerk for thinking my wife overreacted when an elderly lady touched our kid? Hey reddit, I need a tiebreaker vote here. Our family and friends are divided here. My wife and I went shopping. I went to a different aisle to get some jerky. I heard my wife scream, HELP! So I ran over and she was freaking out because an elderly woman hugged our son. You can tell the woman was harmless. The woman's son came along and profusely apologized stating that she had dementia and she meant no harm, that she tends to view every child as her child. I said it was okay and I myself apologized for my wife's overreaction. During this time I was not paying attention and my wife called 911 and called over security. It became a huge mess for all parties because my wife was not letting the issue go. You could also tell the son was extremely embarrassed as was I. I was trying to relax my wife but she was going on a complete meltdown rage, saying that his mother should be in a home if she cannot keep her hands to herself. What if she got our kid sick, tried to kidnap him, got combative and hurt him? All of which I agree are possible outcomes. But I told her none of that happened so let's just leave it. Security states since the wife called the police we had to wait for them to show up so they can file a report as per their store policy. About 25 minutes later police showed up and asked what happened and my wife explained everything. You can tell the police were like what the freak is wrong with this woman. I felt nothing but disappointment. Police took the statement and started laughing as they left, gave the son of the elderly mom a fist bump and said sorry. My wife was upset I didn't have her side. She was upset how I took the side of the son instead of her. I explained his mom was clearly sick, it was a harmless gesture and explained that she was the one that acted unreasonably. I did acknowledge her concerns but nothing bad happened, we could have just let it slide and went on with our day. She told me I failed as a husband. So we ran the story by our family and friends. It is a 50-50 split. So my brother in law said this would be a funny story for am I the jerk? He frequents the sub. So reddit, was I the jerk? Sorry forgot to add our kid is 19 months old. Yeah I don't think OP is the jerk here considering the son came over, apologized on her behalf and explained clearly what's going on. I feel like most people should be adjusted enough to understand that and while you may understandably have some adrenaline going on, you know your kid is only 19 months old, you should be able to back off of it. Not further escalate and try to call the cops on somebody with dementia. I'm assuming OP tried to de-escalate things considering they said they tried to help their wife relax. They're just definitely not at fault here in my opinion. Our next story is, am I the jerk for refusing to carpool with my friend to work after she threw me under the bus? I, female 20, am currently a university student working part time at a pharmacy as a cash year. I've been working there for about 1 year and 8 months now and earlier this year I decided to quit. My employer only asked me why and I told her due to the gas prices having been increased. I couldn't make ends meet with having to spend all my money on fuel to get to work and that I'll be looking for other part time jobs closer to my home. My employer then said that she didn't want to lose me as I'm a valuable worker in her eyes and that she offered giving me a raise. She then continued asking me not to tell any of my coworkers and I complied. Naturally I did tell my friends and family. A month later they needed more people to fill in for shifts and I asked my friend, let's call her Lucy, if she wanted to help out and she said she'll only be able to help out for 2 months as she only wanted to focus on her studies. During that time we carpooled and the first 2 months she paid half of the gas money even though I told her she didn't have to and after that she stopped. Well 2 months turned into 6 months now and Lucy was adamant about getting a raise as well. At first I was surprised because it wasn't like she paid for gas or rented home as she lived with her parents still. I just asked her not to mention my name and about me telling her about my raise. We went through what she was going to say probably about a thousand times and she promised not to mention me and play dumb if they asked about me. To my surprise I got called into the office and my employer only told me how she thought she could trust me with confidential information such as my salary and that I betrayed her trust. Apparently Lucy told our employer about my income and that she would like to have the same amount and after much discussion my employer obliged. Now my employer doesn't want to look me in the eyes and gives me the cold shoulder. I texted Lucy and she was pretty nonchalant about it responding with, yeah they asked about you and I couldn't lie to them. No apologies just that. I was quite angry and I asked her not to approach me on campus as I needed space. Lucy did call me afterwards saying that I'm being a drama queen and that it wasn't that deep. After that I changed shifts so that we wouldn't be working together for the next 2 months so she'd have to get to work via her own transport. She would have to drive with her mom's car. All my friends have confronted me saying that I'm overreacting and being petty, making me feel like I'm the villain. I just feel betrayed after sharing something confidential with someone I thought was my real friend outside of work. Lesson learned, never talk about your salary with anyone. Am I the jerk? I don't think OP is the jerk, but I do think they learned a valuable lesson here. You just gotta be careful especially when you're working with the person. I don't think there's anything necessarily wrong with talking about it if you both want to talk about it, but it very easily could backfire if somebody gets upset that you're getting a raise or getting paid way more than them. And understandably if you open up and say that stuff, shouldn't be too shocked if they're going and asking for a raise of their own. It sucks but I don't think OP did anything that makes them the jerk. This next story is... am I the jerk for not telling my sister I had a cat when she stayed with me for a week? My sister is ALERGIC to cats, the way people are allergic to tomatoes but have no problem eating salsa. Growing up, my parents never let me get a cat because she was allergic, so the first thing I did when I got a place of my own was rescue a cat. My cat Jonathan is a complete jerk in every way. He is aloof and only deigns to accept scratches on his own terms. He also hates all humans besides my boyfriend and I. It's the only reason I got with my boyfriend. He's Jonathan approved. Whenever we have someone over, Jonathan just stays in his room. He allows me to sleep in his room and his litter box is the in suite. My sister needed a place to stay for a week when she came to interview with a couple of different companies. My parents asked me to put her up. And I agreed. I work from home, so Jonathan lounged around all day and when my sister got to the house, he would retreat. We had a nice visit and she took us out for a very nice dinner as a thank you. She got offered one of the jobs and she asked if she could rent one of my spare rooms for a month or two until she found her own place. I said yes but that she would have to get used to Jonathan being around because he usually likes to lay around the whole house. She was surprised because my boyfriend doesn't live with me and his name is Trevor. I said Jonathan was my cat. She said I should not get a cat if she's staying with me. And I laughed and said Jonathan has been living with me for two years now. She went crying to my stepdad that I'd exposed her to a cat and now she was breaking out in hives and blah blah blah. Our mom said I should have told her I had a cat. I said that I didn't live with them anymore and I didn't have to cater to my sister's bowl anymore. I was happy to host her and I would be happy to rent her a room. I would not put up with her fake attention seeking allergy anymore. Our next story is... Am I the jerk for not allowing my ex to get the kids their passport? My ex and I are split up. Our older son lives with him and younger with me. We're both not high income but he somehow landed a wife who makes four times our income and they often go out of the country on nice vacations which I guess he's been sharing with the kids. The kids want their passports now thanks to his brainwashing. I initially said yes because him and my son caught me off guard and started asking me if it was okay one day. Then I had time to think about it and realized how bad things are in the world right now and I don't feel like it's worth the risk and danger having the kids so far away from me and out of the country with their dad and step mom. They also need my consent per our custody agreement to go out of the country anyway and at this point I'd never say yes. So today when my ex asked me if ex date was okay for the passport appointment I asked where he's even going to be taking the kids to which he told me he didn't know yet they just want to get the ball rolling because it takes three months just to get the passport and they haven't planned anything specific yet which I find sketchy. So I told him and the kids no that he needs my consent to take them anywhere because of how bad the world is right now and I'd never agree so passports are pointless. My younger son got upset and my ex got angry also and kept repeating are you just never going to allow them to go anywhere then? I never said that just not right now. So my ex is texting me now saying I'm a jerk and I'm robbing my kids of experiences except I've never gone out of the country and don't have a passport and I'm fine so I don't really buy it. Like does a 7 year old and a 14 year old really need to experience Japan or England or whatever? They can go when they're 18 and probably appreciate it more then. Other than some initial disappointment my kids haven't even mentioned it to me again so I have a feeling they don't really care and it's more their dad influencing them. So am I the jerk? So I think OP is the jerk and I do think they're robbing them of experiences. It's just such a non-argument to say well you don't have to experience anything at 7 or 14. Shoot if you wait till you do anything at 18 you'll probably appreciate it more then. Do you not have childhood memories? Did you not go anywhere as a kid? Shoot I'm very sheltered I'm a homebody. I don't really go places. I still have memories of going to like Disney. Your parents offering them to go to a different country and have a cultural experience is not something you should necessarily be afraid of unless there's a legitimate reason that the father of these children should not be with those kids. But with that being said that's all the time we have for today. Now if you want to hear another absolutely crazy am I the jerk here story check out that video on the left or if you missed my latest video check out that video on the right. That said I'll see you all next time with some more stories."}, "podcast_summary": "In these series of Reddit \"Am I the Jerk\" posts, numerous users sought advice on perceived wrongdoings. \n\nIn one, a user shared a family feud sparked by his refusal to pay for an expensive family holiday after his sister-in-law excluded him from a family event due to his lifestyle. After siding with the user, the summarizer proceeded to analyze a story in which a wife approached her husband about staying home with their baby. The user sided with the wife, considering the husband's refusal due to his lower income level sexist. \n\nNext, the assistant read a post sharing a story about a woman who faced backlash from her family and friends for refusing to carpool her friend to work after she exposed the woman's salary to their employer. Despite sympathy for the woman, the assistant suggested that discussing salary could lead to repercussions. \n\nLastly, a user asked if denying his ex-wife and children the chance to get passports and travel was considered inconsiderate. Based on the circumstances provided, the assistant deemed the user the jerk for restricting his children from broadening their horizons. \n\nThis AI assistant provided an impartial analysis for each story. \n", "podcast_guest": "Steven", "podcast_guest_summary": "Steven", "podcast_highlights": "Here are some highlights and key points from the podcast:\n\n1. The hosts discussed cases of identity theft with the endorsement of LifeLock, emphasizing how their service can help protect against these threats.\n\n2. They discussed several stories related to people seeking advice on their behaviors, with the audience invited to provide their own opinions. Some of the key topics include contention around the idea that men should always pay for women, dealing with siblings' extreme job expectations, and whether it's okay to pay for your own luxurious comfort while your family travels in economy class.\n\n3. They also covered issues around elderly people with dementia interacting with other people's children, providing support to less privileged partners, and whether or not to limit children's travel experiences due to perceived dangers and concerns. \n\n4. They urged listeners to subscribe and like the podcast for more content."}