{"podcast_details": {"podcast_title": "Messianic Apologetics", "episode_title": "Bride of Messiah – McKee Moment Shorts", "episode_image": "https://messianicapologetics.blog/wp-content/uploads/powerpress/Messianic_Apologetics_podcast_icon.jpg", "episode_transcript": " Let me ask you a question. How do you relate to God other than the quite obvious creation to the Creator? Let me say something controversial. Throughout a great deal of my experience in the Messianic community, the frequent analogy which is used for people to relate to God is that of a bride to a bridegroom, and that we as the body of Messiah are to think of ourselves as His bride, waiting patiently, virginally for Him as a coming husband. Now it's true, there are many important lessons to be taken from that because marriage is a point of reference to describe the relationship of God to God's people, but it is not the only analogy which is used. One of the most frequent analogies used to describe the relationship of God to God's people, as is clearly evident in the Lord's Prayer of Yeshua, is that of father to children. And of course, without question, another frequent reference that we see regarding God and God's people is that of king and subject. We also see other analogies such as a field owner to his servants. We see references to God as a military commander and we are serving as His foot soldiers. And there are of course other ways we can understand our relationship as God's people to God. Now, why do we see in, I would have to say, far too much of our collective Messianic experience, a reference to God as bridegroom and us as bride? I don't know. Is it because of some complementarian to quasi-patriarchal influences which have gotten out of hand? Yes, to a wide extent that would be correct. Many people, married persons, can relate to God via that sort of analogy. Many others, such as myself, cannot do so as easily. And fortunately, the diversity of Holy Scripture, the diversity of God's Word, allows there to be other ways we can relate a child to a father, subject to a king, soldier to the general of an army, a laborer to an owner. Things like this. The Holy Scriptures are broad and diverse. Why? Because the stations of human beings in life on this planet are broad and diverse."}, "podcast_summary": "In this episode of the podcast, the host explores the various ways in which people relate to God, questioning the routine use of the bride-bridegroom analogy in the Messianic community. While acknowledging the insights that can be gained from the marriage metaphor, he suggests that this analogy is perhaps overly used, potentially due to influence from complementarian or patriarchal perspectives. He raises this concern because he believes this specific metaphor doesn't resonate with everyone's personal experience.\n\nHowever, other frequent analogies are used to describe the relationship of God to God's people: father-child, king-subject, field owner-servant, and military commander-soldier. He points out the diversity in these descriptions, emphasizing how they help different people, with their diverse experiences and roles in life, relate to God.\n\nThe host posits that it's vital to remember this variety because it ensures that everyone, regardless of their life station or personal experiences, can find a resonance in the scriptures and a way to connect and understand their relationship with God. He encourages listeners to explore these different metaphors, suggesting that the diversity of holy scriptures mirrors the diversity of human life and experience. Therefore, individuals can choose what suits their unique ways of relating to the divine.", "podcast_guest": "John McKee", "podcast_highlights": "1. The podcast guest discusses the various analogies used to describe the relationship between God and his followers. These analogies include a bridegroom to a bride, a father to his children, a king to his subjects, a field owner to his servants, and a military commander to his foot soldiers.\n   \n2. He observes that there seems to be an over-emphasis on the analogy of God as bridegroom to his followers as bride. He suggests this could be due to the influence of complementarian or patriarchal beliefs.\n\n3. The speaker points out that while many people can relate to the bridegroom and bride analogy, there are many who may not find it as relatable or accessible. For these individuals, the multitude of other analogies provided in holy scriptures may be more relevant or resonant.\n\n4. He further notes that the expansive range of these analogies reflects the diversity of human existence and experience. \n\n5. The speaker emphasizes that the multi-faceted relationship between God and his followers can be best understood through a variety of diverse and broad references which accommodate the different life stations of human beings on this planet."}